{"data":[
    {
        "img":"https://apseeds.ap.gov.in/Assets/Images/inner-pages-img/Groundnut.jpg",
        "title":"Ground Nut",
        "msg":"Groundnut farming requires warm climates, well-drained soil, and regular watering. Plant seeds at a depth of 5-7 cm, space them 10-15 cm apart, and harvest when leaves turn yellow and dry. Store the cured groundnuts in well-ventilated containers to prevent moisture buildup.",
        "full-detail":"Groundnut, also known as peanut is a popular crop grown for its edible seeds. It is widely cultivated in various regions around the world, including Africa, Asia, and the Americas. Here is some information about groundnut plant farming: Climate and Soil Requirements: Groundnuts thrive in warm climates with temperatures between 25 to 35 degrees Celsius (77 to 95 degrees Fahrenheit). The crop requires well-drained sandy or loamy soil with a pH range of 5.5 to 7.0. It is important to avoid waterlogged or heavy clay soils. Varieties: There are several groundnut varieties available, and the choice depends on the specific requirements of your region. Common varieties include Spanish, Virginia, and Valencia. Land Preparation: Prepare the land by removing weeds and debris. Plow the soil to a depth of 15 to 20 centimeters (6 to 8 inches) and level it properly. Planting: Groundnuts can be sown directly into the field or started in nurseries for transplanting. If sowing directly, plant seeds at a depth of 5 to 7 centimeters (2 to 3 inches), with a spacing of about 10 to 15 centimeters (4 to 6 inches) between plants and 45 to 75 centimeters (18 to 30 inches) between rows. Irrigation: Groundnuts require regular and adequate watering, especially during critical growth stages such as flowering and pod formation. Irrigate the crop based on soil moisture conditions to avoid water stress. Fertilization: Conduct a soil test to determine the nutrient requirements of your soil. Generally, groundnuts require nitrogen, phosphorus, and potassium. Apply organic matter or well-balanced fertilizers based on the recommended dosage for your specific soil conditions. Weed Control: Frequent weeding is essential to control weed competition. Hand weeding is common, especially during the early stages of growth. Mulching can also help suppress weeds. Disease and Pest Management: Groundnuts are susceptible to various diseases and pests, including leaf spot, rust, rosette, aphids, and termites. Regular monitoring, crop rotation, use of disease-resistant varieties, and appropriate pesticide application can help manage these issues. Harvesting: Groundnuts are ready for harvest when the leaves turn yellow and begin to dry. Carefully dig the plants, shake off excess soil, and allow them to dry in the field for a few days. Remove the pods from the plants and cure them in a well-ventilated area for about two to three weeks. Storage: After curing, store the groundnut pods in well-ventilated containers or bags to avoid moisture buildup, which can lead to mold or fungal growth. Properly dried groundnuts can be stored for several months. Remember to consult with local agricultural experts or extension services for specific recommendations tailored to your region, as local conditions may vary."
    
    },
    {
        "img":"https://miro.medium.com/v2/resize:fit:1400/1*brgt6gPYKhf3aGHjWjTnNg.png",
        "title":"Sugar Cane",
        "msg":"Sugar cane farming requires tropical or subtropical climates, fertile soil, and adequate water supply.  Plant cane cuttings or seedlings in rows with proper spacing. Harvest mature cane by cutting it close to the ground, and process it for sugar extraction or other uses.",
        "full-detail":"Climate and Soil Requirements: Sugarcane thrives in tropical and subtropical climates with temperatures between 20 to 35 degrees Celsius (68 to 95 degrees Fahrenheit). It requires well-drained, fertile soil with a pH range of 6.0 to 7.5. The crop is sensitive to frost and drought conditions.Varieties: There are various sugarcane varieties available, and the choice depends on factors such as sugar content, disease resistance, and local conditions. Popular varieties include Co 86032, Co 8021, and Co 1148. Land Preparation: Clear the land of weeds and debris. Plow the soil to a depth of 20 to 25 centimeters (8 to 10 inches) to ensure proper root development. Level the field and create furrows or ridges for planting. Planting: Sugarcane can be propagated using stem cuttings, called setts. Cut healthy cane stalks into 2 to 3 node pieces and plant them in the furrows or ridges. Plant the setts horizontally with about 2 to 3 nodes buried in the soil, and maintain a spacing of around 60 to 120 centimeters (24 to 48 inches) between rows. Irrigation: Sugarcane requires consistent and adequate water supply throughout its growth cycle. Irrigate the crop regularly, especially during dry periods, to ensure proper growth and sugar accumulation. Drip irrigation or furrow irrigation systems are commonly used. Fertilization: Conduct a soil test to determine the nutrient requirements of your soil. Sugarcane generally requires nitrogen, phosphorus, and potassium. Apply fertilizers based on the recommended dosage for your specific soil conditions. Split the application to provide nutrients at different growth stages. Weed Control: Weed competition can significantly impact sugarcane growth. Use herbicides or implement manual weeding to control weeds. Timely weed management is crucial during the early stages of growth. Disease and Pest Management: Sugarcane is susceptible to various diseases and pests, including smut, rust, leaf scald, sugarcane aphids, and borers. Practice crop rotation, remove infected plants, and apply appropriate pesticides to manage these issues. Regular monitoring and early intervention are key. Harvesting: Sugarcane is ready for harvest when the lower leaves turn yellow and dry. Harvesting time varies depending on the variety and intended use. Cut the cane stalks close to the ground using a sharp knife or machete. Leave the tops intact for regrowth in subsequent ratoons. Processing: After harvesting, sugarcane is processed to extract juice, which is then processed into sugar or used for other purposes such as ethanol production. Processing methods may include milling, crushing, clarification, evaporation, crystallization, and drying. It's important to consult with local agricultural experts or extension services for specific recommendations tailored to your region, as sugarcane farming practices can vary based on local conditions and practices."
    },
    {
        "img":"",
        "title":"",
        "msg":"",
        "full-detail":""
    },
    {
        "img":"",
        "title":"",
        "msg":"",
        "full-detail":""
    },
    
    {
        "img":"",
        "title":"",
        "msg":"",
        "full-detail":""
    },
    {
        "img":"",
        "title":"",
        "msg":"",
        "full-detail":""
    },
    {
        "img":"",
        "title":"",
        "msg":"",
        "full-detail":""
    },
    {
        "img":"",
        "title":"",
        "msg":"",
        "full-detail":""
    },
    {
        "img":"",
        "title":"",
        "msg":"",
        "full-detail":""
    }
    
]
}